import { AnimatePresence, motion } from 'motion/react';
function CardModal({ index, onClose }: any) {
  const messages = [
    'ปีใหม่แล้วนะ! 🎉 ปีที่ผ่านมาหนูน่าจะเจออะไรมาเยอะแยะเลยทั้งเรื่องที่ดีและไม่ดี และมันก็ทำให้หนูเติบโตขึ้นและเป็นหนูในทุกวันนี้นะคะ ปีนี้ก็ขอให้หนูพบเจอแต่สิ่งดี ๆ เลย ทั้งผู้คนทั้งสังคม ขอให้มีแต่คนใจดีกับหนูเยอะๆนะคะ!!',
    'อยากจะบอกว่าหนูเก่งมากที่ผ่านปีที่ผ่านมาได้ ไม่ว่าจะเจอเรื่องอะไรมา ขอให้ปีนี้เป็นปีที่ดีและมีความสุขมาก ๆ นะคะ รวมถึงประสบความสำเร็จในทุก ๆ สิ่งที่หนูพยายามอยู่นะคะ 😊',
    'อยากจะบอกว่าขอบคุณที่หนูเกิดมานะคะ โลกนี้น่าจะสดใสขึ้นมากเลยที่มีหนูอยู่ ขอให้ปีนี้เป็นปีที่ดีและมีความสุขมาก ๆ นะคะ ❤️',
    'ส่วนการ์ดนี้ อาจจะวกวนหน่อยนะคะ 5555 ก็คืออยากบอกว่าขอบคุณที่เข้ามาในชีวิตพี่นะคะ หนูทำให้ปีที่ผ่านมาของพี่พิเศษขึ้นมามากๆเลย ถึงเราจะรู้จักกันโดยบังเอิญ แต่อยากบอกว่าความรู้สึกที่พี่มีต่อหนูนั้นพี่ตั้งใจมากๆเลยค่ะ 💖 หนูเป็นคนสุดท้ายของปีที่แล้ว และเป็นคนแรกของปีนี้ด้วยนะคะ ขอบคุณจริงๆนะที่เปิดใจให้ พี่จะตั้งใจรักต่อไป จะรอคำตอบจากหนูไปเรื่อยๆเลย ขอบคุณทุกสิ่งที่พาเรามาได้พบกันนะคะ ปีนี้มาใช้ชีวิตกันให้เต็มที่เลยนะคะคนเก่ง',
  ];

  return (
    <motion.div
      initial={{ opacity: 0 }}
      animate={{ opacity: 1 }}
      exit={{ opacity: 0 }}
      className="fixed inset-0 bg-black/40 flex items-center justify-center z-50"
      onClick={onClose}
    >
      <motion.div
        initial={{ scale: 0.6, rotateY: 180 }}
        animate={{ scale: 1, rotateY: 0 }}
        transition={{ type: 'spring' }}
        className="bg-white rounded-2xl p-8 w-80 text-center"
        onClick={(e) => e.stopPropagation()}
      >
        <h2 className="text-2xl font-bold text-pink-500 mb-4"></h2>
        <p className="text-gray-700">{messages[index]}</p>
      </motion.div>
    </motion.div>
  );
}

export default CardModal;
